Revit 2026 API

# StructuralSectionConcreteRound Methods

---

The StructuralSectionConcreteRound type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from StructuralSection) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundarySize | Returns size of the section boundary. (Inherited from StructuralSection) |
|  | GetEnumerator | (Inherited from StructuralSection) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

StructuralSectionConcreteRound Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace